{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for some new running shoes. I've been browsing for a while, but I'm overwhelmed by the options. Can you help me find something good?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Of course! I can definitely help with that. To give you the best recommendations, could you tell me a little about your running habits? For example, how many miles do you run per week, what kind of surfaces do you typically run on, and what kind of support or features are you looking for?",
      "response_time": 5.55,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.08,
        "benevolence": 5.64,
        "integrity": 5.02
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, well, I run about 20-25 miles a week, mostly on roads and sometimes on trails. I need good arch support because I pronate a bit. Honestly, I just want something comfortable and durable. I'm getting frustrated looking at all these shoes!",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand. Based on that, I recommend looking at the Brooks Adrenaline GTS series. They're known for excellent support and durability, and are well-suited for road and moderate trail use. They also tend to be very comfortable. I can provide links to several retailers that sell them if you'd like. Would you like that?",
      "response_time": 5.01,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.93,
        "benevolence": 5.92,
        "integrity": 5.47
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Hmm, the Brooks Adrenaline GTS, I've seen those recommended before, but they're often quite expensive. Are there any other shoes that offer a similar level of support and durability but at a lower price point? I'm on a budget.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid concern. Finding a balance between performance and cost is important. While I can certainly give you some suggestions, it's tricky as the availability and sales of specific models constantly fluctuate. I can recommend looking at the Saucony Guide series. They are similar in terms of support and durability, and often available at a lower price point than the Brooks. It also may be worth checking out websites that offer deals on older model versions. I can try to check recent price comparisons, but I can't guarantee perfect accuracy. Would you like me to do that for you?",
      "response_time": 2.48,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.48,
        "benevolence": 4.36,
        "integrity": 3.7
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Yes, please! That would be great, thank you. I'll check those out.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_5bbaaebb",
    "average_trust_score": 5.0,
    "trust_category_averages": {
      "competence": 5.16,
      "benevolence": 5.31,
      "integrity": 4.73
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 5,
      "anger": 1
    },
    "response_quality_score": 4.51,
    "latency_score": 3.15
  }
}