{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for some new shoes. I like a casual, almost minimalist style, but I also need something I can wear to work occasionally. Any suggestions?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! Based on your preferences, I recommend looking into brands like Allbirds or Veja for the casual minimalist aspect. For work, perhaps consider some leather sneakers or sleek loafers. Could you tell me more about the type of work you do? That would help me narrow down the options.",
      "response_time": 4.5,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.69,
        "benevolence": 5.57,
        "integrity": 5.41
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, Allbirds and Veja, I'll check those out. But, I'm in a creative field, so it's not super formal, but also not jeans-and-t-shirt casual. What about sustainability? Are there any brands that are both stylish and sustainable, and that also offer a variety of styles?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's a great question! Finding shoes that fit your style, work environment, and sustainability preferences simultaneously can be tricky. Besides Allbirds and Veja, which have good sustainability practices, brands like Cariuma and Rothy's are also popular and have a variety of styles. However, finding a single brand that perfectly matches all criteria can be difficult. It depends on your specific preferences. I'd recommend researching each brand in more detail to see which aligns best with your priorities. I can also give you a list of sustainable materials if you'd like to filter your search.",
      "response_time": 5.13,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.71,
        "benevolence": 5.65,
        "integrity": 5.71
      }
    }
  ],
  "data": {
    "conversation_id": "conv_37659db6",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.7,
      "benevolence": 5.61,
      "integrity": 5.56
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "neutral": 4
    },
    "response_quality_score": 5.06,
    "latency_score": 2.69
  }
}