{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I'm looking for a new noise-canceling headset for work. My budget is... let's say under $150. What are my best options? I'm so tired of background noise during meetings!",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! Based on your budget of under $150, I recommend considering the Jabra Elite 45h. It offers excellent noise cancellation and comfort for its price point. Another option to look at is the Anker Soundcore Life Q30; these often get good reviews. Would you like me to provide links or more information on either of those?",
      "response_time": 5.76,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.27,
        "benevolence": 5.24,
        "integrity": 5.41
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Hmm, I've heard mixed things about the Soundcore's microphone quality. That's really important for me. Are there any alternatives, maybe pushing just *slightly* above $150, if it significantly improves the microphone? What's the point of noise canceling if no one can hear me clearly?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "You're right, microphone quality is crucial for work. Considering that, and a slight budget increase, the Logitech Zone Vibe 100 is a strong contender. While its noise canceling isn't *quite* as robust as the other two, its microphone clarity is consistently praised, and it often goes on sale for around $170. A less common option but highly respected for mics is the EPOS Sennheiser ADAPT 260, though this may require checking several retailers to find it near your price point. Do either of those sound appealing?",
      "response_time": 5.7,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.06,
        "benevolence": 5.8,
        "integrity": 5.56
      }
    }
  ],
  "data": {
    "conversation_id": "conv_e5f57696",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.16,
      "benevolence": 5.52,
      "integrity": 5.48
    },
    "engagement_score": 4.83,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 3
    },
    "response_quality_score": 5.57,
    "latency_score": 1.77
  }
}