{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I'm looking for a new pair of noise-cancelling headphones. I've browsed a bunch of sites, but I'm just overwhelmed with options. Can you help me narrow it down?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! To give you the best recommendations, could you tell me a bit more about your needs? What's your budget, what will you primarily use them for (e.g., travel, work, gym), and do you have a preference for over-ear or in-ear headphones?",
      "response_time": 3.52,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.68,
        "benevolence": 5.1,
        "integrity": 5.96
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, budget is around $200, mostly for travel and working in a noisy coffee shop. I definitely prefer over-ear headphones for comfort. Also, good call quality for calls is important. Now, here's a tough one... what if I lose them? Are there headphones with a tracking feature, or do you offer some kind of insurance on electronics?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Thanks for the details! Based on your preferences, I recommend checking out the Sony WH-CH720N and the Anker Soundcore Life Q30. Both are well within your budget, offer excellent noise cancellation and call quality, and are over-ear. Regarding your concern about losing them, some headphones, like certain models from Apple and Tile, have built-in tracking features. While we don't directly offer insurance on electronics, you may be able to add product protection through a third party like Asurion or Upsie. I hope that helps!",
      "response_time": 5.56,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.18,
        "benevolence": 5.14,
        "integrity": 5.89
      }
    }
  ],
  "data": {
    "conversation_id": "conv_8d0f01d9",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.43,
      "benevolence": 5.12,
      "integrity": 5.92
    },
    "engagement_score": 4.83,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 3
    },
    "response_quality_score": 5.9,
    "latency_score": 2.96
  }
}