{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I've been having these persistent headaches for about two weeks now, mostly in the mornings. I'm also feeling really tired all the time, even after sleeping.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. Persistent headaches and fatigue can be caused by a variety of factors. To help me narrow down the possibilities, could you tell me more about the headaches? For example, where exactly do you feel the pain, how would you describe the pain (throbbing, dull, sharp), and what, if anything, seems to trigger or relieve them?",
      "response_time": 3.27,
      "emotion_detected": "sadness",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.4,
        "benevolence": 4.19,
        "integrity": 3.87
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, the pain is mostly behind my eyes and in my temples. It's a dull ache, usually. Nothing really triggers it that I can tell, and honestly, nothing really makes it go away except maybe sleeping it off, which is hard because I'm already tired! I've tried over-the-counter pain relievers, but they don't do much. Is this something I should be really worried about?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "While I cannot provide a diagnosis, your symptoms could be indicative of several things including tension headaches, sinus issues, or even just dehydration. To rule out anything serious, and given the persistence of your symptoms, it would be best to consult with a doctor. They can perform a physical exam and potentially order tests if necessary. In the meantime, ensure you are drinking plenty of water, maintaining a regular sleep schedule, and managing stress.",
      "response_time": 3.27,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.42,
        "benevolence": 5.79,
        "integrity": 5.58
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Ugh, I was hoping you could tell me something more specific. I was trying to avoid going to the doctor! But I guess you're right. If you *had* to guess (I know you're not a doctor!) what's the *least* scary thing it could be?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_49c6a829",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.91,
      "benevolence": 4.99,
      "integrity": 4.72
    },
    "engagement_score": 4.67,
    "emotion_distribution": {
      "sadness": 3,
      "neutral": 1,
      "fear": 1
    },
    "response_quality_score": 5.18,
    "latency_score": 4.23
  }
}