{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I'm feeling really lost career-wise. I've been in my current role for five years and I'm not sure where to go from here.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello. I understand. It's common to feel that way. To get started, could you tell me a bit about your current role and what you like or dislike about it?",
      "response_time": 3.6,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.83,
        "benevolence": 5.42,
        "integrity": 5.83
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Well, I'm a marketing assistant. I mostly handle administrative tasks and some social media. Honestly, I'm bored out of my mind most of the time. I want something more challenging, with more responsibility.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, I see. It sounds like you're seeking more growth and challenge. Have you considered what kind of responsibilities would fulfill you? Perhaps a marketing manager role, or something else entirely? What about your skillset, what are your strengths?",
      "response_time": 2.4,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.15,
        "benevolence": 4.14,
        "integrity": 3.65
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "That's the problem. I don't really know. I *think* I'm good with people, I'm organized, and I'm creative (with the social media stuff). But I'm not sure what jobs utilize those skills that I would actually enjoy. There are just so many options it's overwhelming. How do I even start narrowing it down?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid concern, it can be daunting to navigate the job market. To help you, I can suggest career aptitude tests, or we can delve into your past experiences. What kind of industry interests you? Also, do you have any hobbies or interests that you would enjoy incorporating into your career? I can offer a list of jobs that involve social media, people skills, and organizational skills if you like.",
      "response_time": 3.42,
      "emotion_detected": "fear",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.7,
        "benevolence": 4.4,
        "integrity": 4.28
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, that's helpful. But how can I realistically transition to a completely different field if I don't have much experience in that area? For instance, what if I decided I want to be a project manager? I'm not sure I have the relevant skills on paper.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 8,
      "speaker": "agent",
      "utterance": "That's an excellent and challenging question! The good news is, transferable skills are incredibly valuable. While you may not have 'Project Manager' on your resume, your organizational skills from your marketing assistant role, along with your people skills for collaboration, are very relevant. We can reframe your experience on your resume to highlight those skills and prepare for interviews, or look for entry-level project management positions. It can be done! Let's assess the gap between the required skills and your current skills.",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.98,
        "benevolence": 6.7,
        "integrity": 6.94
      }
    }
  ],
  "data": {
    "conversation_id": "conv_a67e14df",
    "average_trust_score": 5.12,
    "trust_category_averages": {
      "competence": 5.17,
      "benevolence": 5.17,
      "integrity": 5.18
    },
    "engagement_score": 4.92,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 5,
      "surprise": 1,
      "fear": 1
    },
    "response_quality_score": 5.61,
    "latency_score": 3.65
  }
}