{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I'm looking to book a hotel in San Francisco for 2 nights, from August 10th to August 12th. I'd like something with a pool, if possible, and my budget is around $300 per night. This is proving harder than I thought!",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Okay, I understand. Searching for hotels in San Francisco for August 10th to 12th, with a pool and a budget of $300 per night. I'm showing a few options, including the Hotel Nikko San Francisco and the Hyatt Regency San Francisco. The Nikko is slightly above your budget at $320/night, but the Hyatt is within range at $280/night. Would you like more details on either of these?",
      "response_time": 3.94,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.9,
        "benevolence": 4.0,
        "integrity": 4.35
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Hmm, that's a bit disappointing that the Nikko is over budget. Could you tell me more about the Hyatt Regency? And also, why are hotel prices in San Francisco so volatile? Is there a pattern or reason for the fluctuations?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Certainly. The Hyatt Regency San Francisco offers comfortable accommodations with bay views, a heated outdoor pool, and is conveniently located near the Embarcadero. It receives generally positive reviews for its location and amenities. As for your question about price volatility, San Francisco hotel prices are influenced by numerous factors, including seasonal demand (summer being peak season), major events like conferences and festivals, and overall economic conditions. Prices can fluctuate significantly based on these variables. Supply and demand plays a large role, just like anything else. Is there anything else I can help you with?",
      "response_time": 3.86,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.0,
        "benevolence": 4.03,
        "integrity": 4.02
      }
    }
  ],
  "data": {
    "conversation_id": "conv_80a81568",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 3.95,
      "benevolence": 4.02,
      "integrity": 4.18
    },
    "engagement_score": 4.08,
    "emotion_distribution": {
      "surprise": 2,
      "neutral": 2
    },
    "response_quality_score": 3.58,
    "latency_score": 3.6
  }
}