{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, so I've been having this persistent cough for about a week now. It's mostly dry, but sometimes I cough up a little bit of phlegm. I also feel really tired all the time. I'm just not sure what's going on. It's really frustrating!",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand your frustration. A persistent cough and fatigue can be concerning. To help me understand your situation better, could you tell me if you've experienced any other symptoms, such as fever, sore throat, body aches, or shortness of breath? Also, have you been exposed to anyone who is sick recently?",
      "response_time": 2.37,
      "emotion_detected": "anger",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.79,
        "benevolence": 2.04,
        "integrity": 2.49
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "No fever, no sore throat. I had some body aches a few days ago, but they're mostly gone now. I haven't been around anyone I know of who's sick, but who really knows these days, right? Also, this might be a silly question, but could it be allergies, even though it's December?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "While less common in December, allergies are still possible, especially if you're exposed to indoor allergens like dust mites or mold. However, given your symptoms – persistent cough, fatigue, and previous body aches – it's more likely to be a respiratory infection. Since I cannot provide medical diagnoses, I would strongly recommend consulting a doctor to rule out more serious conditions such as bronchitis or pneumonia. They can properly assess your situation and recommend the best course of action. In the meantime, rest, stay hydrated, and consider using a humidifier.",
      "response_time": 3.05,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.93,
        "benevolence": 3.83,
        "integrity": 3.78
      }
    }
  ],
  "data": {
    "conversation_id": "conv_e70aa904",
    "average_trust_score": 3.25,
    "trust_category_averages": {
      "competence": 3.36,
      "benevolence": 2.94,
      "integrity": 3.13
    },
    "engagement_score": 4.33,
    "emotion_distribution": {
      "sadness": 1,
      "anger": 1,
      "neutral": 2
    },
    "response_quality_score": 3.0,
    "latency_score": 4.79
  }
}