{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I've been having this nagging cough for about three weeks now, and it's really starting to get on my nerves. I'm also feeling really tired all the time. Any idea what it could be?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand you're experiencing a persistent cough and fatigue. These symptoms can be associated with a variety of conditions, such as a common cold, the flu, bronchitis, or even allergies. To give you a more personalized assessment, could you tell me if you have any other symptoms, like a fever, sore throat, or body aches?",
      "response_time": 2.76,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.75,
        "benevolence": 3.59,
        "integrity": 4.39
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "No fever, no sore throat. I have been a bit congested though, and my muscles ache a little, but I thought that was just from sleeping wrong. Is there anything I can do to treat it? I'm getting really frustrated with feeling so tired all the time.",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, congestion and muscle aches alongside the cough and fatigue suggest it could be a viral infection like a cold or the flu. I can't provide medical advice, but generally, rest, hydration, and over-the-counter pain relievers like ibuprofen or acetaminophen can help alleviate the symptoms. However, if your symptoms worsen or persist for more than a week, or if you develop a high fever or difficulty breathing, it's important to consult a doctor.",
      "response_time": 3.12,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.12,
        "benevolence": 3.85,
        "integrity": 4.19
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that makes sense. But if it *is* just a cold, why is it lasting so long? Shouldn't it be gone by now? And if it's the flu, wouldn't I have a fever? I'm just trying to figure out if I'm overreacting or not.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_ae28a924",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 3.94,
      "benevolence": 3.72,
      "integrity": 4.29
    },
    "engagement_score": 5.17,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 3,
      "anger": 1
    },
    "response_quality_score": 4.25,
    "latency_score": 4.56
  }
}