{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I need help finding some shoes. I'm looking for something stylish, but I'm not sure where to start.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I can definitely assist with that. To give you the best recommendations, could you tell me a little more about your style? What kind of activities do you usually wear shoes for?",
      "response_time": 4.78,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.66,
        "benevolence": 5.36,
        "integrity": 5.58
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, well, I need something that's versatile. I mostly work from home, but I want something I can wear when I go out to meet friends or run errands. Casual, but still put together, you know?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Understood. Based on your needs, I'd recommend looking at some options such as: Leather sneakers (e.g., Adidas Stan Smiths), Loafers, or Chelsea boots. These styles are versatile and can be dressed up or down. Would you like me to provide some specific examples, or perhaps search for a particular brand for you?",
      "response_time": 4.54,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.58,
        "benevolence": 5.49,
        "integrity": 5.33
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Hmm, okay. Leather sneakers sound good, but I'm a bit overwhelmed by all the options. What makes a good leather sneaker versus a bad one? Is there a big difference in quality, and if so, how do I tell?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a great question! Quality in leather sneakers is largely determined by the leather type (full-grain is best), the construction method (stitched soles are generally more durable), and the materials used in the insole and lining. Higher-quality sneakers will often have better support and a more comfortable fit. To identify quality, look for a smooth, consistent leather texture, reinforced stitching, and check the brand's reputation for craftsmanship. Brands like Common Projects or Greats are known for quality, but even some more affordable options from brands like Adidas or Nike can be good if you are selective about the material and construction.",
      "response_time": 4.12,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.51,
        "benevolence": 5.85,
        "integrity": 5.26
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Wow, thanks! That's really helpful. I think I have a better understanding now. I'll do some research based on your advice. I appreciate the help!",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_aeeace40",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.58,
      "benevolence": 5.57,
      "integrity": 5.39
    },
    "engagement_score": 4.33,
    "emotion_distribution": {
      "neutral": 5,
      "surprise": 2
    },
    "response_quality_score": 5.96,
    "latency_score": 3.02
  }
}