{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I need help writing a resume. I haven't updated mine in ages and I'm completely lost. Where do I even start?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I can certainly help with that. First, let's gather some information. Could you tell me about your work experience, education, and any skills you possess? Don't worry about formatting yet; just provide the raw details. We can structure it later.",
      "response_time": 5.56,
      "emotion_detected": "fear",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.78,
        "benevolence": 5.9,
        "integrity": 5.76
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, well... I worked as a project manager for the last 5 years at Acme Corp, before that I was a Senior Analyst there for 3 years. I have a master's degree in Business Administration. I'm proficient in MS Project and Agile methodologies. Oh, and I have a PMP certification. Honestly, that's the easy part. It's the bullet points that kill me. How do I make all of that sound... impressive?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand. Crafting compelling bullet points can be challenging. For your project management role, consider quantifying your achievements whenever possible. For example, instead of writing \"Managed projects,\" try something like \"Managed projects with budgets ranging from $50,000 to $500,000, consistently delivering projects on time and within budget.\" I can help you refine your bullet points to make them more impactful. Just provide me with the specifics of your accomplishments.",
      "response_time": 4.61,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.62,
        "benevolence": 5.24,
        "integrity": 5.57
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "That's helpful, thanks. But here's a tough one: I had a gap in my employment for a year while I was dealing with a family health issue. How do I address that without raising red flags or potentially being discriminated against? I'm really stressed about this!",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_832ded79",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.7,
      "benevolence": 5.57,
      "integrity": 5.67
    },
    "engagement_score": 5.42,
    "emotion_distribution": {
      "sadness": 1,
      "fear": 1,
      "surprise": 1,
      "neutral": 2
    },
    "response_quality_score": 5.58,
    "latency_score": 2.42
  }
}