{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I'm finally tackling my resume. It's been years, and I'm feeling totally overwhelmed. Where do I even start?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. It's a common feeling! Let's start with the basics. First, gather all your previous job titles, company names, dates of employment, and a list of your responsibilities and accomplishments for each role. Do you have that information readily available?",
      "response_time": 4.8,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.0,
        "benevolence": 5.1,
        "integrity": 5.39
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Yeah, I think so. I have most of it in a scattered mess of old documents and emails. I guess I should consolidate it all first? Ugh, this is going to take forever.",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Exactly. Consolidating that information is a crucial first step. Once you have that, we can discuss the best format for your resume based on your career goals. Consider using a chronological, functional, or combination format. Which one you choose will largely depend on your employment history and what you're trying to highlight.",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.6,
        "benevolence": 6.65,
        "integrity": 6.54
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Chronological, functional...combination? I'm even more lost now! What's the difference? And which one is best for someone who's been at the same company for 10 years but held several different roles?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "A chronological resume lists your experience in reverse chronological order, highlighting career progression. A functional resume focuses on your skills and abilities, downplaying work history. A combination resume blends both. Given your tenure and different roles within one company, a combination resume might be most effective, as it allows you to showcase your skills while demonstrating your loyalty and growth within the organization.",
      "response_time": 3.36,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.57,
        "benevolence": 5.76,
        "integrity": 5.24
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, combination sounds promising. But here's my biggest worry: How do I quantify my accomplishments? Everyone says I need numbers, but I wasn't exactly tracking metrics in my old roles. Is it okay to estimate or should I just leave the achievements section blank?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 8,
      "speaker": "agent",
      "utterance": "It's definitely preferable to quantify your accomplishments whenever possible. If exact figures aren't available, it's acceptable to estimate, but be prepared to back up those estimates during an interview. For example, instead of 'Improved customer satisfaction,' you could say 'Improved customer satisfaction scores by approximately 15% based on internal surveys.'",
      "response_time": 3.53,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.86,
        "benevolence": 4.03,
        "integrity": 3.54
      }
    },
    {
      "turn_id": 9,
      "speaker": "user",
      "utterance": "That's actually really helpful, thanks! I feel like I have a slightly better direction now. Baby steps, I guess.",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_6146aeab",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.26,
      "benevolence": 5.38,
      "integrity": 5.18
    },
    "engagement_score": 5.7,
    "emotion_distribution": {
      "surprise": 2,
      "neutral": 4,
      "disgust": 1,
      "fear": 1,
      "joy": 1
    },
    "response_quality_score": 5.13,
    "latency_score": 3.08
  }
}