{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey! I'm looking for some new shoes. I'm so tired of my old ones. I need something stylish, but I'm not sure where to start. I usually wear pretty casual clothes, but I want something that can dress up an outfit if needed. Any ideas?",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hi there! I can definitely help with that. To give you the best recommendations, could you tell me a bit more about what you mean by 'stylish'? Are you thinking more classic, trendy, edgy, or something else entirely? Also, what kind of casual clothes do you usually wear?",
      "response_time": 4.29,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.23,
        "benevolence": 5.79,
        "integrity": 5.42
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Ugh, I don't know! Trendy, I guess? I usually wear jeans, t-shirts, sometimes a casual dress or skirt. I just want something that doesn't look like I'm trying too hard, but still looks put-together. And ideally, something comfortable!",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, got it. For a trendy but comfortable option that can be dressed up or down with jeans, t-shirts, dresses, or skirts, I would suggest Chelsea boots or white sneakers. Chelsea boots offer a bit of sophistication, while white sneakers are versatile and clean. Alternatively, have you considered loafers? Many modern loafer styles exist.",
      "response_time": 2.46,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.65,
        "benevolence": 4.22,
        "integrity": 3.66
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that's helpful. White sneakers are a good idea. But what about sustainability? Are there any brands that focus on environmentally friendly materials and ethical production for white sneakers? That's actually pretty important to me.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_24a5c335",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.44,
      "benevolence": 5.0,
      "integrity": 4.54
    },
    "engagement_score": 5.17,
    "emotion_distribution": {
      "joy": 1,
      "neutral": 3,
      "disgust": 1
    },
    "response_quality_score": 4.78,
    "latency_score": 4.12
  }
}