{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for a new pair of running shoes. I've been browsing your site for a while and keep getting the same recommendations. Can you help me find something new?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! I can definitely help with that. To give you better recommendations, could you tell me a bit more about what you're looking for? For example, what kind of running do you do (road, trail, track), how often do you run, and what's your budget?",
      "response_time": 4.72,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.29,
        "benevolence": 5.49,
        "integrity": 5.8
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, I mostly run on roads, about 3-4 times a week, usually 5-7 miles each time. My budget is up to $150. But honestly, I'm still a bit confused about all the different shoe technologies. How do I even know what features I *need*?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's a great question! Based on your info, I'd recommend looking for shoes with good cushioning and durability, since you run regularly on roads. Brands like Hoka, Brooks, and Saucony often get good reviews. For features, focus on the midsole – it's crucial for shock absorption. Try reading some customer reviews on those shoe brands and see what features people mention. Finding the perfect fit is key; you might need to experiment a bit! I'll also generate a list with shoe recommendations based on your preferences, please wait...",
      "response_time": 4.12,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.77,
        "benevolence": 5.31,
        "integrity": 5.38
      }
    }
  ],
  "data": {
    "conversation_id": "conv_fdce692f",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.53,
      "benevolence": 5.4,
      "integrity": 5.59
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "neutral": 4
    },
    "response_quality_score": 5.71,
    "latency_score": 3.08
  }
}