{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for some new running shoes. Can you give me some recommendations?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Of course! To give you the best recommendations, could you tell me a little more about what you're looking for? For example, what kind of running do you do (road, trail, track)? What's your typical mileage per week? Any specific brand preferences?",
      "response_time": 4.88,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.24,
        "benevolence": 5.17,
        "integrity": 5.49
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, I mainly run on roads, about 20-25 miles a week. I've been using Brooks lately but I'm open to other brands. And I need something with good cushioning, my knees aren't what they used to be.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Based on your preferences, I'd recommend checking out the Brooks Glycerin series or the Hoka Clifton. Both are known for excellent cushioning and are popular among road runners. I can also suggest some Asics models like the Gel-Kayano, as they offer good stability as well. Would you like me to provide links and further details on any of these?",
      "response_time": 4.44,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.19,
        "benevolence": 5.74,
        "integrity": 5.67
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, the Brooks Glycerin sounds familiar. Can you tell me the main differences between the Glycerin 20 and the 21? I'm seeing both online and I'm not sure which to get.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "Certainly! The Glycerin 21 offers a slightly updated midsole, often providing a more energetic feel compared to the Glycerin 20. Many users also report improvements in the upper's breathability and comfort. It may depend on your preference, but the Glycerin 21 is generally considered an incremental update, but a good one. I would recommend reading reviews or checking out a comparison video for a more thorough understanding. Here is a link: [link to comparison video]",
      "response_time": 5.14,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.1,
        "benevolence": 5.34,
        "integrity": 5.43
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "That's helpful, thanks. But the video is talking about the different types of midsoles, I don't understand any of this! Can you explain it in simpler terms?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 8,
      "speaker": "agent",
      "utterance": "My apologies for the technical jargon! Essentially, the midsole is the part of the shoe that provides cushioning. Glycerin 21 features a slightly advanced foam, meant to offer a more 'bouncy' or responsive feel. The Glycerin 20 uses a slightly older version, but it's still highly cushioned. Think of it like this: the 21 is a little more 'springy' underfoot, while the 20 provides a comfortable, but maybe a tad less energetic ride. Does that make more sense?",
      "response_time": 4.83,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.32,
        "benevolence": 5.65,
        "integrity": 5.95
      }
    },
    {
      "turn_id": 9,
      "speaker": "user",
      "utterance": "Yes! Much better, thank you. I think I'll try the 21s then. Any suggestions on where to buy them?",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 10,
      "speaker": "agent",
      "utterance": "Glad I could help! You can find the Glycerin 21 at most major running retailers, such as REI, Running Warehouse, or directly on the Brooks website. Prices may vary, so I'd suggest comparing offers from multiple sources. Happy running!",
      "response_time": 6.0,
      "emotion_detected": "joy",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 7.0,
        "benevolence": 6.91,
        "integrity": 7.0
      }
    }
  ],
  "data": {
    "conversation_id": "conv_df9722d7",
    "average_trust_score": 5.8,
    "trust_category_averages": {
      "competence": 5.57,
      "benevolence": 5.76,
      "integrity": 5.91
    },
    "engagement_score": 5.03,
    "emotion_distribution": {
      "neutral": 8,
      "joy": 2
    },
    "response_quality_score": 5.86,
    "latency_score": 2.44
  }
}