{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I'm feeling really stuck in my current job and need some career advice. I'm not sure what I should do next or even what I'm good at anymore.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I understand you're feeling uncertain about your career path. I'm here to help you explore your options. Could you tell me a little bit about your current role and what makes you feel stuck or unfulfilled?",
      "response_time": 4.38,
      "emotion_detected": "fear",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.01,
        "benevolence": 5.48,
        "integrity": 5.94
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "I'm a marketing coordinator. It's okay, the people are nice, but the work is repetitive, and there's no growth potential. I've been here for five years, and honestly, I just dread Mondays. I used to be creative and excited, but now I just feel... drained. I don't even know where to start looking or what else I'd be qualified for.",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Thank you for sharing that. Feeling drained and lacking growth are common reasons for seeking a change. To help identify potential new directions, let's think about your interests, skills, and values. What aspects of your current role, if any, do you enjoy? What activities do you find energizing outside of work?",
      "response_time": 5.85,
      "emotion_detected": "sadness",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.48,
        "benevolence": 5.48,
        "integrity": 5.8
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Ugh, I've thought about the 'interests and skills' thing, but it just feels like I'm going in circles. My skills are all marketing-specific! How do I figure out which of my current skills are *actually* transferable to a completely different field, like something more analytical or even non-profit work? It feels impossible to know what's valuable elsewhere, and frankly, the job market feels like a black hole right now. Is it even realistic to make a big pivot with my background?",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a very valid concern, and it's common to feel overwhelmed by the perceived gap between your current role and a desired new field. Many skills gained in marketing, such as communication, project management, data analysis (even basic), critical thinking, and understanding consumer behavior, are highly transferable. While making a significant pivot can be challenging, it is absolutely realistic with strategic planning. We can explore specific roles in analytical fields or non-profits and identify which of your marketing skills directly apply or could be adapted. It often requires highlighting your foundational competencies rather than just job-title specific tasks.",
      "response_time": 3.68,
      "emotion_detected": "surprise",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.96,
        "benevolence": 3.72,
        "integrity": 4.29
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, that makes a bit more sense about the transferable skills like project management. But how do I actually *find* job titles or companies that value those skills from a marketing background? It still feels like such a massive task to search for these roles that aren't explicitly 'marketing'. Where do I even start filtering the thousands of job postings to find opportunities that might actually be a fit for someone like me?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_ba943e7a",
    "average_trust_score": 5.0,
    "trust_category_averages": {
      "competence": 4.82,
      "benevolence": 4.89,
      "integrity": 5.34
    },
    "engagement_score": 5.08,
    "emotion_distribution": {
      "sadness": 2,
      "fear": 2,
      "disgust": 1,
      "surprise": 1,
      "neutral": 1
    },
    "response_quality_score": 4.55,
    "latency_score": 2.86
  }
}