{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I've been having really bad headaches lately, almost every day. It's starting to affect my work. Any ideas what might be causing them?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. Frequent headaches can be debilitating. To better understand the potential causes, could you describe the headaches in more detail? For example, where do you feel the pain, what does it feel like (throbbing, sharp, etc.), and are there any specific triggers you've noticed (stress, certain foods, lack of sleep)?",
      "response_time": 4.13,
      "emotion_detected": "fear",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.99,
        "benevolence": 3.75,
        "integrity": 4.16
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, um, the pain is mostly behind my eyes and in my temples. It feels like a throbbing ache, and sometimes it's sharp. I think stress makes it worse, definitely. Also, I've been sleeping terribly recently. I've tried over-the-counter painkillers, but they only help a little. I'm so frustrated!",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Thank you for providing more information. Throbbing headaches behind the eyes and temples, exacerbated by stress and poor sleep, could indicate tension headaches or migraines. Over-the-counter pain relievers are often the first line of defense. Have you considered any lifestyle changes to manage your stress and improve sleep, such as meditation, exercise, or establishing a regular sleep schedule?",
      "response_time": 4.1,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.29,
        "benevolence": 5.94,
        "integrity": 5.28
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Yeah, I've tried meditation apps, but honestly, I find it hard to switch off. And with work, it's difficult to stick to a strict sleep schedule. If it's migraines, is there anything I can do to stop them before they even start, without just taking pills all the time? Are there any alternative therapies that actually have scientific backing, or is it all just wishful thinking?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_3b8e6710",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.64,
      "benevolence": 4.85,
      "integrity": 4.72
    },
    "engagement_score": 4.67,
    "emotion_distribution": {
      "neutral": 3,
      "fear": 1,
      "anger": 1
    },
    "response_quality_score": 5.14,
    "latency_score": 3.38
  }
}