{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I'm so frustrated with trying to write this resume. I've been staring at a blank page for hours. I need help making it sound… impressive. Can you help me write a resume to apply for software engineering positions?",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand your frustration. Resume writing can be challenging. I can definitely assist you. To start, could you tell me about your work experience, skills, and any projects you've worked on? The more detail you provide, the better I can tailor your resume.",
      "response_time": 4.34,
      "emotion_detected": "anger",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.77,
        "benevolence": 5.18,
        "integrity": 5.6
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Alright, let's see... I worked as a Junior Developer at Acme Corp for two years, mainly using Python and Django. Before that, I had a six-month internship at Beta Industries, focusing on front-end development with React. And I've got a bunch of personal projects on GitHub, like a to-do list app and a basic e-commerce site. Oh, and I'm proficient in Java as well. What's the best way to phrase all of that in a way that sounds good?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, great! How about this for your work experience at Acme Corp: \"Junior Developer at Acme Corp. Leveraged Python and Django to develop and maintain key features of [mention specific product or application], resulting in [quantifiable achievement, e.g., a 15% increase in user engagement].\" For Beta Industries: \"Front-End Development Intern at Beta Industries. Contributed to the development of user interfaces using React, gaining experience in [mention specific technologies or methodologies, e.g., component-based architecture].\" For your personal projects, list them on your resume with a brief description and a link to your GitHub repository. This allows recruiters to easily view your work. Should I list Java as a skill or something else?",
      "response_time": 4.26,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.55,
        "benevolence": 5.28,
        "integrity": 5.35
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "That's...better, I guess. But how do I make sure my resume gets past those automated screening systems? I've heard they just scan for keywords, so how do I know which keywords to even include? It seems kind of pointless if it's just going to be rejected by a bot.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_5e4958fb",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.66,
      "benevolence": 5.23,
      "integrity": 5.47
    },
    "engagement_score": 4.92,
    "emotion_distribution": {
      "anger": 2,
      "neutral": 3
    },
    "response_quality_score": 5.24,
    "latency_score": 3.2
  }
}