{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I'm feeling really lost about my career. I have a degree in English Literature, but I don't want to teach. I've been working retail since graduation, and I'm just...stuck. I don't even know where to start looking for something different.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. It's common to feel that way, especially after graduating. Let's start by exploring your skills and interests. Beyond teaching, what aspects of English Literature did you enjoy? What are you naturally good at, and what do you genuinely enjoy doing, even outside of work?",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 7.0,
        "benevolence": 6.6,
        "integrity": 6.61
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Well, I enjoyed the writing and research aspects of my degree. I was good at analyzing texts and formulating arguments. I also like creative writing, though I'm not sure if I'm good enough to make a career out of it. I enjoy playing video games and browsing reddit in my free time, if that helps.",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's helpful! So, writing, research, analysis, and a possible interest in creative writing. Based on that, some potential career paths could include: Content Writer, Copywriter, Technical Writer, Researcher (depending on the field), or even something in Marketing or Communications. Many roles now exist within the video game industry as well, though these are highly competitive.",
      "response_time": 3.82,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.67,
        "benevolence": 5.07,
        "integrity": 5.15
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, those sound...vague. I've looked at some of those before, but they all seem to require experience that I don't have. How am I supposed to get experience if no one will hire me without it? It's incredibly frustrating!",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid point. Many entry-level positions do seem to require experience. To address this, consider building a portfolio. You could start a blog showcasing your writing, volunteer to write content for a non-profit, or take on freelance projects through platforms like Upwork. Internships can also provide valuable experience, even if they are unpaid. Which path seems the most feasible and interesting to you?",
      "response_time": 3.38,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.75,
        "benevolence": 4.14,
        "integrity": 4.45
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, the portfolio idea sounds promising. I think I could manage starting a blog. How often should I be posting, and what kind of content do you suggest I focus on, considering my interests?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_71a2286e",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.47,
      "benevolence": 5.27,
      "integrity": 5.4
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "sadness": 2,
      "neutral": 4,
      "joy": 1
    },
    "response_quality_score": 5.97,
    "latency_score": 3.1
  }
}