{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I need some help. I'm going to a wedding next month and have absolutely no idea what to wear. My budget is pretty tight, maybe around $150 max.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I can definitely help with that. A budget of $150 for a wedding outfit is manageable. To give you the best recommendations, what's the dress code for the wedding (e.g., black tie, cocktail, casual)? Also, what's your general style preference?",
      "response_time": 5.88,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.44,
        "benevolence": 5.08,
        "integrity": 5.95
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Ugh, I hate weddings. It's cocktail attire. I generally like things that are flattering and a bit edgy, but also classy. I don't want to look like I'm trying too hard. Something that can transition from the ceremony to dancing would be great.",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, cocktail attire with an edgy-classy vibe, and good for dancing. Within a $150 budget, you could consider a few options: a jumpsuit from ASOS (they often have good sales), a well-chosen dress from a place like Lulus, or a skirt and top combination from stores like H&M or Zara. I will give you some links to potential options. However, this might take a little longer to get the links so stay tuned.",
      "response_time": 3.7,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.28,
        "benevolence": 4.24,
        "integrity": 4.42
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that sounds good... but are those stores actually *reliable* for quality? I've had bad experiences ordering online before. And how will you know what sizes would fit me? What if I need alterations?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a great question about the quality and alterations! While I can't guarantee quality control, I can suggest you read customer reviews for the items I recommend. Regarding sizing, I cannot know your exact measurements, however, I can provide sizing guides from the stores I suggest. For alterations, you'll need to factor that cost into your budget and find a local tailor. I would advise buying something that requires minimal alterations to save money. Give me a few more minutes to generate those links for you.",
      "response_time": 1.43,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.58,
        "benevolence": 2.15,
        "integrity": 2.17
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, that's actually really helpful. Thanks!",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_8a1afd02",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 4.1,
      "benevolence": 3.82,
      "integrity": 4.18
    },
    "engagement_score": 4.46,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 4,
      "disgust": 1,
      "joy": 1
    },
    "response_quality_score": 3.8,
    "latency_score": 3.83
  }
}