{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I need help updating my resume. It's been like, five years, and I'm pretty sure it's awful. Where do I even start?",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I can definitely help with that! Let's start with the basics. Do you have a current version of your resume that you can share, or would you prefer to start from scratch? We can discuss different resume formats and content based on your experience and the jobs you're targeting.",
      "response_time": 5.33,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.45,
        "benevolence": 5.97,
        "integrity": 5.61
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "I have one, but it's seriously outdated. I guess share it? How do I even do that? Also, targeting jobs... I'm not even sure what I want to do next, honestly. Just something better than what I'm doing now. *sigh*",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "You can share the resume by copying and pasting the text here. As for job targeting, it's helpful to have some idea of the types of roles you're interested in, even broadly (e.g., project management, customer service, data analysis). This allows us to tailor your resume to highlight relevant skills and experience. Otherwise, a general format is fine.",
      "response_time": 5.64,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.4,
        "benevolence": 5.84,
        "integrity": 5.41
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, here's the text: [Outdated resume text]. I guess project management sounds good... but like, what if I'm selling myself short? What if I COULD be doing something amazing, but I'm pigeonholing myself with project management?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "Thanks! Regarding your concern about pigeonholing yourself, it's a valid point. We can craft your resume to highlight transferable skills that are valuable across different industries and roles. This way, you're targeting project management positions but also keeping your options open. We can then adjust for specific positions later.",
      "response_time": 5.73,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.75,
        "benevolence": 5.3,
        "integrity": 5.66
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Transferable skills... Okay, that sounds promising. What are the most important transferable skills for, like, anything these days? Is it all just AI now? I'm so confused by all this new tech.",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 8,
      "speaker": "agent",
      "utterance": "Some of the most valuable transferable skills include communication (written and verbal), problem-solving, critical thinking, adaptability, teamwork, and leadership. While AI skills are certainly in demand, these core skills remain essential across industries. Showcasing examples of these skills is often more valuable than stating you *have* them.",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 7.0,
        "benevolence": 7.0,
        "integrity": 7.0
      }
    },
    {
      "turn_id": 9,
      "speaker": "user",
      "utterance": "Okay, that's actually really helpful. So, instead of just saying 'Managed projects,' I should give examples that show my communication and problem-solving skills? Like, 'Led a project team of 5 to successfully deliver X, overcoming Y challenges through effective communication and proactive problem-solving'? Is that the kind of thing you mean? I think I'm finally getting this!",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_0fcba13c",
    "average_trust_score": 5.88,
    "trust_category_averages": {
      "competence": 5.9,
      "benevolence": 6.03,
      "integrity": 5.92
    },
    "engagement_score": 5.75,
    "emotion_distribution": {
      "disgust": 1,
      "neutral": 5,
      "sadness": 1,
      "surprise": 2
    },
    "response_quality_score": 5.76,
    "latency_score": 1.83
  }
}