{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for a new pair of running shoes. I've been browsing your site, but I'm overwhelmed by all the options. Can you recommend something?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I can certainly help with that. To give you the best recommendations, could you tell me a bit about your running habits? For example, how many miles do you run per week, what kind of surfaces do you usually run on (road, trail, track), and do you have any preferred brands or features (cushioning, stability, etc.)?",
      "response_time": 4.68,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.32,
        "benevolence": 5.91,
        "integrity": 5.88
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, good questions. I run about 20-25 miles a week, mostly on pavement. I'd like good cushioning because my knees aren't what they used to be, and I generally prefer Asics. I'm not too picky beyond that. Something that's not going to break the bank would be great too. Honestly, I'm a little frustrated; I've spent hours looking already!",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Understood. Based on your preferences, I recommend the Asics GEL-Kayano 29 for its excellent cushioning and stability, ideal for road running. It's a popular model, so you can often find it at a decent price. Alternatively, the New Balance Fresh Foam X 880v13 is another excellent option known for its comfort and durability. \n\nHowever, I'm also seeing some conflicting information in my database. Some customer reviews for the GEL-Kayano 29 mention a slight increase in the price in the last month. Can you tell me how accurate the price information is on the website currently? I am unsure if I can show you the correct pricing right now.",
      "response_time": 4.55,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.68,
        "benevolence": 5.99,
        "integrity": 5.27
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Hmm, that's a really interesting question. I'll check the website and see what I can find for the prices. In the meantime, how do these shoes compare in terms of responsiveness? I'm concerned about getting something that feels too sluggish.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_345332bd",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.5,
      "benevolence": 5.95,
      "integrity": 5.57
    },
    "engagement_score": 4.67,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 3,
      "anger": 1
    },
    "response_quality_score": 5.92,
    "latency_score": 2.88
  }
}