{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I need some serious help. I have a budget of $50 for groceries this week, and I need to make it last for one person. What are some cheap, healthy meal ideas or shopping strategies?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I can certainly help with that. A $50 budget for one person for a week is definitely achievable. To make your budget stretch, focus on staples like rice, pasta, beans, and lentils. Frozen or canned vegetables are often more affordable than fresh and last longer. Look for store brand items and check for sales or coupons. Planning your meals before shopping can also help you avoid impulse buys.",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.67,
        "benevolence": 7.0,
        "integrity": 7.0
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "That's... helpful in theory, I guess. But how do I actually put that into practice? Like, how do I get enough protein without buying expensive meat? And frozen veggies feel so limited. It just feels impossible to eat well on so little!",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand your frustration. Getting sufficient protein affordably is key. Consider plant-based options like dried beans, lentils, chickpeas, and tofu, which are very cost-effective and versatile for stews, curries, or even salads. Eggs are also a great source of cheap protein. For frozen vegetables, while selection varies, you can often find things like spinach, broccoli, peas, corn, and mixed blends that work well in stir-fries, soups, or casseroles. Pairing these affordable protein and veggie sources with your grains like rice or pasta will help you build balanced meals within your budget.",
      "response_time": 2.31,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.33,
        "benevolence": 2.89,
        "integrity": 2.14
      }
    }
  ],
  "data": {
    "conversation_id": "conv_925e11bf",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.5,
      "benevolence": 4.95,
      "integrity": 4.57
    },
    "engagement_score": 5.08,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 2,
      "disgust": 1
    },
    "response_quality_score": 4.74,
    "latency_score": 3.34
  }
}