{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Honestly, I'm just feeling so stuck in my current job. Like, really frustrated. I've been doing it for 5 years and I just don't see a future here, but I don't even know where to start looking for something new. It's overwhelming.",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "It's understandable to feel overwhelmed when considering a career change. Taking the first step can be challenging. To begin, it might be helpful to explore your interests, skills, and values to identify potential new paths. Reflecting on what you enjoy and what you're good at can provide direction. Are there any particular industries or roles that have caught your attention recently?",
      "response_time": 2.67,
      "emotion_detected": "surprise",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.26,
        "benevolence": 4.25,
        "integrity": 3.77
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Yeah, I've tried that a bit, thinking about interests... but it feels like wishful thinking. Like, I'm in accounting now, and I'm interested in environmental conservation, but I have zero relevant experience or qualifications for that. How do you even *realistically* bridge a gap that huge? 'Exploring interests' doesn't pay the bills or get me hired when I have no background.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's a very practical and important point. Bridging significant career gaps requires a strategic approach beyond just identifying interests. For a large shift like moving from accounting to environmental conservation, consider focusing on building foundational knowledge and networks. This could involve taking online courses or certificate programs in environmental science or policy, volunteering for relevant non-profits to gain practical experience, attending industry events or webinars, and conducting informational interviews with people working in conservation roles to understand required skills and entry points. It's a gradual process of acquiring new skills and making connections in the new field.",
      "response_time": 3.1,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.32,
        "benevolence": 4.38,
        "integrity": 4.32
      }
    }
  ],
  "data": {
    "conversation_id": "conv_607059b9",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 4.29,
      "benevolence": 4.31,
      "integrity": 4.04
    },
    "engagement_score": 4.33,
    "emotion_distribution": {
      "anger": 1,
      "surprise": 1,
      "neutral": 2
    },
    "response_quality_score": 4.27,
    "latency_score": 4.62
  }
}