{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I need some new shoes, but I'm so overwhelmed by all the options! I mostly wear casual clothes, like jeans and t-shirts. What kind of shoes would you recommend?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Okay! Based on your preference for casual wear, I'd suggest considering sneakers, loafers, or even Chelsea boots. Sneakers are versatile, loafers offer a slightly more polished look, and Chelsea boots can dress up an outfit. To give you better recommendations, are there any specific styles you like or dislike? For example, do you prefer a more minimalist or a bolder look?",
      "response_time": 3.71,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.94,
        "benevolence": 4.27,
        "integrity": 3.8
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Hmm, that's helpful. I'm not a fan of super flashy sneakers. And honestly, I'm a little confused about the Chelsea boots thing. They look cool but I'm not sure how to wear them with jeans. Can you explain that? Also, are there any brands you recommend that are known for quality AND don't cost a fortune?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay! Regarding Chelsea boots and jeans, you can usually wear them with a slim or straight leg jean. The boots should fit snugly under the hem of your jeans - or you can cuff the jeans to show off the boots. As for brands, for quality and reasonable prices, I'd recommend looking at brands like Vans, Adidas, and Clark's (for loafers and Chelsea boots). Specific models will depend on your budget, but I can help you find options within a specific price range if you provide one. Do any of those brands appeal to you?",
      "response_time": 2.46,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.57,
        "benevolence": 4.3,
        "integrity": 3.63
      }
    }
  ],
  "data": {
    "conversation_id": "conv_54c0b788",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 3.75,
      "benevolence": 4.29,
      "integrity": 3.71
    },
    "engagement_score": 4.83,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 3
    },
    "response_quality_score": 3.85,
    "latency_score": 4.42
  }
}