{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I'm trying to understand why my medical claim was denied. It just says 'lack of medical necessity'. Can you help me break this down?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I can certainly try. 'Lack of medical necessity' usually means the insurance company doesn't believe the service or procedure was essential for your health, based on the information they received. Do you have the Explanation of Benefits (EOB) document? It might provide more details.",
      "response_time": 2.4,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.59,
        "benevolence": 3.79,
        "integrity": 4.41
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Yes, I have the EOB. It's not very helpful. It just reiterates the denial reason, and says my doctor didn't provide enough documentation. But he *did*! I'm so frustrated! What exactly constitutes sufficient documentation? Isn't that a bit vague?",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand your frustration. The requirements for sufficient documentation can indeed vary based on the specific insurance plan and the type of service. Generally, it includes things like the patient's medical history, exam findings, diagnosis, treatment plan, and the rationale for the service. However, to get more specific guidance for *your* denial, I would need access to the specific denial code. Do you know what the code is?",
      "response_time": 2.16,
      "emotion_detected": "anger",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.87,
        "benevolence": 2.74,
        "integrity": 2.27
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, let me look... Hmm, the code is 4576. Now, based on this code, and the description that the documentation was insufficient, what would be the *exact* documentation needed for the denial to be overturned? Give me *specific* examples, I really need to get this sorted out and the insurance company is not being helpful at all.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_eb61770f",
    "average_trust_score": 3.25,
    "trust_category_averages": {
      "competence": 3.23,
      "benevolence": 3.27,
      "integrity": 3.34
    },
    "engagement_score": 4.92,
    "emotion_distribution": {
      "neutral": 3,
      "anger": 2
    },
    "response_quality_score": 3.32,
    "latency_score": 5.22
  }
}