{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I need help writing a resume. I've been applying for jobs for months and I'm not even getting interviews. I think my resume is terrible. Can you help me make it better?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Yes, I can definitely help you with that! I can assist you with formatting, content suggestions, and tailoring your resume to specific job applications. To start, could you please provide me with your current resume? Or, if you prefer, we can start with the basics like your work history, skills, and education. We can also explore different resume templates. Which approach works best for you?",
      "response_time": 5.29,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.02,
        "benevolence": 5.38,
        "integrity": 5.93
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Alright, let's start from scratch. I guess that's the best approach. The problem is, I have a gap in my employment history. I was traveling for a year. How do I even address that? I'm worried it'll immediately disqualify me.",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Addressing employment gaps requires a strategic approach. You can briefly mention the travel in your resume, for instance, under the \"Experience\" section, or in a section for \"Additional Information\". You can label it as a \"Sabbatical\" or \"Career Break\", and briefly describe the activities, skills, and experiences you gained during that period. I can help you craft the perfect wording and make the gap a plus. For example, \"Career Break - International Travel and Cultural Immersion (2022-2023)\", followed by a short description of any relevant skills gained. Let's get started!",
      "response_time": 4.22,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.66,
        "benevolence": 5.29,
        "integrity": 5.98
      }
    }
  ],
  "data": {
    "conversation_id": "conv_f6762ceb",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.34,
      "benevolence": 5.33,
      "integrity": 5.96
    },
    "engagement_score": 4.83,
    "emotion_distribution": {
      "fear": 2,
      "neutral": 2
    },
    "response_quality_score": 5.06,
    "latency_score": 2.75
  }
}