{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I have an interview for a Software Engineer role at Google next week. I'm feeling super overwhelmed. Can you help me prepare?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Absolutely! I can definitely assist you. To start, what areas are you most concerned about? Are you struggling with technical questions, behavioral questions, or something else? We can go over common interview topics like data structures and algorithms, system design, or even mock interview practice. Also, do you have a resume or job description I can review?",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.64,
        "benevolence": 6.92,
        "integrity": 6.67
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Honestly, all of the above. I'm decent with coding challenges, but system design terrifies me. Also, I'm worried about the 'tell me about a time when...' questions. And no, I don't have the job description handy right now. One more thing, how do I even handle a question about a project I failed on without looking completely incompetent?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, that's a lot to cover. Let's start with system design. I can provide you with resources and examples for common design patterns. For the behavioral questions, we can practice answering them using the STAR method (Situation, Task, Action, Result). For the project failure question, the key is honesty and showing what you learned from the experience. Frame it as an opportunity for growth. For more specific advice on the project question, provide me with the details of the project. I'll help you find the right angle for answering the question. Would you like to start with system design or behavioral questions?",
      "response_time": 2.6,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.66,
        "benevolence": 4.03,
        "integrity": 3.64
      }
    }
  ],
  "data": {
    "conversation_id": "conv_3436a377",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.15,
      "benevolence": 5.47,
      "integrity": 5.16
    },
    "engagement_score": 5.08,
    "emotion_distribution": {
      "surprise": 1,
      "neutral": 2,
      "fear": 1
    },
    "response_quality_score": 5.41,
    "latency_score": 3.2
  }
}