{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I'm completely lost. I received a denial from my insurance company for a recent MRI. The reason code is something about 'medical necessity' but I have no idea what that means or what to do.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello. I can certainly help with that. A denial for 'medical necessity' means your insurance company doesn't believe the MRI was medically required based on the information they have. This often means the provided documentation from your doctor wasn't sufficient. To resolve this, you typically need to appeal the decision. Can you provide me with the denial letter? I can assist you with understanding it better and potentially drafting an appeal.",
      "response_time": 3.91,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.78,
        "benevolence": 3.74,
        "integrity": 3.5
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "I have the denial letter. It's a PDF. Can I upload it or something? Also, what exactly does 'drafting an appeal' entail? This is all really frustrating.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Yes, you can provide the PDF. While I cannot directly upload or process PDFs at this time, you can either summarize the key points or copy and paste the relevant information from the denial letter into this chat. Drafting an appeal typically involves writing a formal letter to your insurance company, explaining why you believe the denial is incorrect. It's often helpful to include additional medical information, like further documentation from your doctor, that supports the medical necessity. For instance, have you had any prior imaging? What symptoms are you experiencing? The more context, the better.",
      "response_time": 3.39,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.3,
        "benevolence": 5.36,
        "integrity": 5.19
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that makes sense. But my doctor already submitted all the information, or so I thought. If I have to get him to do it again, won't that just mean more delay? Is there a standard timeframe or something I should be aware of for how long these appeals typically take? And how can I be sure they will actually *review* it this time? I’ve heard horror stories…",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_e3a99bdc",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.54,
      "benevolence": 4.55,
      "integrity": 4.35
    },
    "engagement_score": 4.67,
    "emotion_distribution": {
      "sadness": 2,
      "neutral": 2,
      "fear": 1
    },
    "response_quality_score": 4.8,
    "latency_score": 3.85
  }
}