{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for some movie recommendations. I'm in the mood for a good action movie, but I'm so tired of the same old stuff. Any suggestions?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! For action movies, I can recommend a few popular choices. Are you looking for anything specific within the action genre, like spy thrillers, superhero movies, or maybe something more gritty and realistic?",
      "response_time": 3.84,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.04,
        "benevolence": 5.63,
        "integrity": 5.17
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Hmm, I've seen a lot of superhero stuff lately, so I'm kind of burnt out on that. I'm not super into spy thrillers either. Something gritty sounds good, maybe like a war movie or a heist? And not something super old, please. And also, I'm really trying to avoid anything with major plot holes, so if you can tell me how a movie handles those issues I'll be impressed.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay, that's a bit of a challenging request, but I can offer some suggestions! Based on your preference for gritty action and avoiding plot holes, I'd recommend 'Heat' (1995). It's a heist film with strong performances, a realistic portrayal of criminal planning, and it's generally praised for its attention to detail and internal consistency. 'Black Hawk Down' (2001) is a great war movie as well. It's often cited for its accuracy and compelling storytelling, but it can be quite intense. If you have specific concerns about plot holes in either film, I can provide some discussion points as well. How do those sound?",
      "response_time": 2.73,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.11,
        "benevolence": 4.03,
        "integrity": 4.08
      }
    }
  ],
  "data": {
    "conversation_id": "conv_4f856cc1",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.58,
      "benevolence": 4.83,
      "integrity": 4.62
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "neutral": 4
    },
    "response_quality_score": 5.01,
    "latency_score": 4.21
  }
}