{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I'm feeling really lost. I've been in the same job for five years and I'm completely burnt out. I don't even know where to begin with figuring out a new career path.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello! I understand. It's a common feeling. To start, we can explore your interests, skills, and values. Have you considered taking any personality or career aptitude tests to help identify potential fields?",
      "response_time": 3.8,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.59,
        "benevolence": 5.17,
        "integrity": 5.78
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "I've taken a few of those over the years, but honestly, the results always seem vague and don't really point me in a clear direction. I feel like I'm just as confused as before! Plus, some of the suggested jobs seem so out of reach.",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand your frustration. Test results aren't always perfect, and it's easy to feel overwhelmed. Perhaps instead of relying solely on tests, we could focus on analyzing your current skills. What do you enjoy doing in your current role, and what tasks do you find most satisfying? Also, what is your ideal work-life balance?",
      "response_time": 2.2,
      "emotion_detected": "surprise",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.76,
        "benevolence": 2.52,
        "integrity": 2.66
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that's a good starting point. But, realistically, how can I transition into a new field with my current experience? I have a lot of general administrative experience, but I don't have any specialized skills that would make me stand out. What if I am not qualified for anything else?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid concern. Many transferable skills can be applied across industries. We can identify those transferable skills, and tailor your resume. We can also discuss upskilling options, whether through online courses, certifications, or further education. I recommend we start by listing your current skills in a detailed list, then researching some similar roles to get a sense of current requirements. ",
      "response_time": 4.98,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.86,
        "benevolence": 5.04,
        "integrity": 5.06
      }
    }
  ],
  "data": {
    "conversation_id": "conv_2f7d4cc9",
    "average_trust_score": 4.5,
    "trust_category_averages": {
      "competence": 4.74,
      "benevolence": 4.24,
      "integrity": 4.5
    },
    "engagement_score": 4.5,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 3,
      "fear": 1,
      "surprise": 1
    },
    "response_quality_score": 4.55,
    "latency_score": 3.84
  }
}