{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, so I'm feeling pretty lost. I've been working as a marketing assistant for three years, and I just... I don't see a future here. I'm not really *passionate* about marketing, but I don't know what else I'd be good at.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. Feeling stuck in a career is a common experience. To help me understand your situation better, could you tell me what aspects of your current role you find least appealing, and what, if anything, sparks your interest, even outside of work?",
      "response_time": 1.43,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.71,
        "benevolence": 2.16,
        "integrity": 2.34
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Well, the data analysis and reporting parts are awful. I just zone out. But I do enjoy brainstorming campaign ideas, even though I don't always feel like my ideas are heard. Outside of work... I really like helping my friends plan events, like birthday parties or even small conferences for their work. I seem to have a knack for logistics and making sure everything runs smoothly.",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's valuable information. It sounds like you enjoy the creative and organizational aspects of events. Have you considered exploring event planning or project management roles? Both often involve brainstorming, logistics, and ensuring smooth execution. I can provide you with some resources on these career paths if you'd like.",
      "response_time": 3.34,
      "emotion_detected": "joy",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.56,
        "benevolence": 4.13,
        "integrity": 3.67
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Project management... maybe. But isn't that, like, super technical? I don't have any certifications or anything. How would I even get my foot in the door? It feels like everyone wants someone with years of experience.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "While some project management roles require specific certifications, many entry-level positions focus on organizational and communication skills. Your experience planning events for friends demonstrates those abilities. We can explore entry-level project coordinator roles or project assistant positions, which often provide on-the-job training. Additionally, volunteer opportunities or online courses could help you gain relevant skills and demonstrate your interest to potential employers. Would you like me to search for some relevant certifications or entry-level positions near you?",
      "response_time": 4.19,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.55,
        "benevolence": 5.4,
        "integrity": 5.01
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, that's... actually encouraging. Yeah, let's see what kind of entry-level positions are out there. Maybe that's the way to go. Thanks!",
      "response_time": null,
      "emotion_detected": "joy",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_5050cdf0",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 3.94,
      "benevolence": 3.9,
      "integrity": 3.67
    },
    "engagement_score": 4.46,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 3,
      "disgust": 1,
      "joy": 2
    },
    "response_quality_score": 3.79,
    "latency_score": 4.51
  }
}