{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I've been feeling really tired lately, even after getting a full night's sleep. What could be causing this?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Hello. Fatigue can stem from a variety of issues. Common causes include insufficient sleep, poor diet, stress, or lack of exercise. Less common, but potentially serious, causes are anemia, thyroid problems, or even underlying infections. To give you the best advice, could you tell me a bit more about your lifestyle and any other symptoms you're experiencing?",
      "response_time": 1.93,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.59,
        "benevolence": 2.66,
        "integrity": 2.04
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Well, I thought I was doing pretty well! I eat healthy-ish, I get about 7-8 hours of sleep most nights, and I try to walk for about 30 minutes a day. But, I am pretty stressed with my job. Also, my iron levels have been low in the past. Could that be related?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Yes, low iron (anemia) can absolutely cause fatigue. It's a very common culprit. Stress is also a significant factor. I'd recommend getting your iron levels checked again through a blood test. If they're low, your doctor can advise on iron supplementation. Regarding the stress, have you considered relaxation techniques like meditation or deep breathing? Also, the quality of your sleep matters, not just the quantity. Are you sleeping soundly? Finally, what if I don't know what to say? Well, I'm still learning and might not be able to provide an accurate answer... How about we try something different?",
      "response_time": 1.51,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.83,
        "benevolence": 2.09,
        "integrity": 2.46
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, that's helpful, I'll talk to my doctor about the iron test. But, honestly, is there any *real* scientific evidence that meditation actually reduces stress? I've always been skeptical about those kinds of things.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_2f3c5f86",
    "average_trust_score": 2.5,
    "trust_category_averages": {
      "competence": 2.71,
      "benevolence": 2.38,
      "integrity": 2.25
    },
    "engagement_score": 4.92,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 4
    },
    "response_quality_score": 2.05,
    "latency_score": 5.78
  }
}