{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I need to stick to a really tight grocery budget this week. Like, under $75 tight. Can you give me some meal ideas?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Yes, I can certainly help with that! Based on a $75 budget, I recommend focusing on meals with beans, lentils, rice, and pasta as a base. For proteins, consider eggs, chicken thighs (often cheaper than breasts), and canned tuna or salmon. Fresh produce is great, but consider frozen vegetables and fruits to save money. To get started, how many people are you cooking for, and what kinds of meals do you enjoy?",
      "response_time": 4.95,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.21,
        "benevolence": 5.35,
        "integrity": 5.28
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Just me and my partner. The problem is, my partner is vegetarian, and I'm not...so we need meals that accommodate both of us. And honestly, I get really bored of beans and rice! Do you have suggestions for things that aren't *just* those?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Alright, accommodating both vegetarian and non-vegetarian diets is achievable! I can suggest a few options that offer flexibility. Consider: \n\n1.  **Lentil Soup:** A hearty, filling soup that can be made vegetarian. Serve with crusty bread and a side salad for the non-vegetarian, adding grilled chicken or sausage.\n2.  **Vegetable Curry with Chickpeas:** Serve with rice, and the non-vegetarian can add some grilled chicken or tofu. This is generally inexpensive if you use canned coconut milk. \n3.  **Pasta Dishes:** You can use pasta as a base and split it between meat sauce and vegetables. The non-vegetarian can eat the meat-based version, and the vegetarian can enjoy the vegetable and cheese option. \n\nDo any of these sound appealing? I can provide specific recipes and estimated costs for each.",
      "response_time": 2.92,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.39,
        "benevolence": 3.67,
        "integrity": 3.88
      }
    }
  ],
  "data": {
    "conversation_id": "conv_817e9111",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.8,
      "benevolence": 4.51,
      "integrity": 4.58
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "neutral": 4
    },
    "response_quality_score": 4.63,
    "latency_score": 3.56
  }
}