{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I'm feeling really stuck in my career. I've been a project manager for five years, and I'm just not excited about it anymore. I don't even know where to start looking for something new.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. Feeling stuck is a common experience. Let's start by exploring what aspects of your current role you find unfulfilling and what you *do* enjoy, even if it's a small part. This will help us identify potential career paths that align better with your interests and values. Can you tell me a bit more about what you dislike about your current role?",
      "response_time": 3.12,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.37,
        "benevolence": 3.66,
        "integrity": 3.77
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Ugh, it's the constant meetings, the endless spreadsheets, and feeling like I'm just pushing papers around. I used to enjoy the problem-solving aspect, but now it feels so repetitive. Honestly, sometimes I think about just becoming a park ranger or something completely different. Is that crazy?",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "It's not crazy at all! Many people dream of a career change that aligns with their passions. Exploring those seemingly 'out there' ideas can actually be very helpful. We can assess whether your skills and interests could translate to something like park ranger work, or if there are other roles that capture the essence of what appeals to you about that profession. Let's look at some of the transferable skills you've developed as a project manager. For example, you are likely proficient in organization, communication, and problem-solving.",
      "response_time": 6.0,
      "emotion_detected": "neutral",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.62,
        "benevolence": 7.0,
        "integrity": 7.0
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, but how do I actually *find* these other roles? I've looked on LinkedIn and Indeed, but it's overwhelming. Everything requires so many qualifications and specific experience. It feels impossible to break into something new. What if I invest time and money in retraining, and then I still can't find a job?",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid concern. Retraining is an investment, and it's wise to be cautious. Let's start by researching the job market for the roles you're interested in. We can look at typical entry-level requirements, potential salary ranges, and growth opportunities. We can also explore alternative paths, such as internships, volunteer work, or informational interviews, to gain experience and build your network. Would you like me to generate a list of potential career options based on your stated dislike of 'constant meetings, endless spreadsheets, and feeling like I'm just pushing papers around' and your appreciation of problem-solving?",
      "response_time": 2.79,
      "emotion_detected": "fear",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.32,
        "benevolence": 3.96,
        "integrity": 4.39
      }
    }
  ],
  "data": {
    "conversation_id": "conv_57fe304e",
    "average_trust_score": 5.0,
    "trust_category_averages": {
      "competence": 5.1,
      "benevolence": 4.87,
      "integrity": 5.05
    },
    "engagement_score": 5.25,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 2,
      "disgust": 1,
      "surprise": 1,
      "fear": 1
    },
    "response_quality_score": 4.66,
    "latency_score": 3.53
  }
}