{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "I've been having this persistent cough for about two weeks now, and I'm starting to get really worried. It's worse at night, and I'm also feeling quite fatigued. Any thoughts?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. A persistent cough and fatigue can be concerning. While I cannot provide medical diagnoses, I can offer some general information. Have you experienced any other symptoms like fever, sore throat, runny nose, or chest pain?",
      "response_time": 3.28,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.19,
        "benevolence": 3.65,
        "integrity": 4.07
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Yes, actually, I did have a mild fever for a couple of days last week, and my nose has been a bit stuffy. Chest pain, no. It's just...this cough is driving me crazy. Could it be something serious like pneumonia, or is it more likely just a cold?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Based on your symptoms, it could potentially be a few different things, including a cold, the flu, or even bronchitis. Pneumonia is also a possibility, although less likely without significant chest pain. It's important to consult a healthcare professional for a proper diagnosis and treatment plan. I cannot recommend a specific treatment, but over-the-counter cough suppressants and decongestants might provide some temporary relief. Drinking plenty of fluids and getting rest are also important.",
      "response_time": 4.86,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.29,
        "benevolence": 5.82,
        "integrity": 5.64
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Okay, I guess that's fair. But how am I supposed to know *when* it's serious enough to actually go to the doctor? Like, what's the threshold here? I don't want to waste their time if it's just a cold, but I also don't want to ignore something serious. This is so frustrating!",
      "response_time": null,
      "emotion_detected": "anger",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_d8cc2b02",
    "average_trust_score": 4.75,
    "trust_category_averages": {
      "competence": 4.74,
      "benevolence": 4.74,
      "integrity": 4.86
    },
    "engagement_score": 5.17,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 3,
      "anger": 1
    },
    "response_quality_score": 4.71,
    "latency_score": 3.43
  }
}