{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I have an interview for a software engineer position at Google next week. I'm a bit nervous. Can you help me prepare?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Yes, I can definitely help! I can provide information on common interview questions, suggest practice problems, and even help you practice answering behavioral questions. To start, what specific areas are you most concerned about? For example, are you worried about data structures and algorithms, system design, or behavioral questions?",
      "response_time": 6.0,
      "emotion_detected": "fear",
      "trust_score": 7.0,
      "trust_category_scores": {
        "competence": 6.99,
        "benevolence": 7.0,
        "integrity": 6.87
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Honestly, all of the above! But I'm especially worried about the system design questions. I always get tripped up on those. Can you give me an example of a difficult system design question they might ask?",
      "response_time": null,
      "emotion_detected": "fear",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Sure. One challenging system design question Google might ask is: \"Design a URL shortener service like TinyURL.\" This involves considerations like handling a large number of requests, choosing a unique short URL generation strategy (e.g., base62 encoding), database selection and scaling, and handling potential collisions. Another common one is 'Design a scalable rate limiter.' The answers often vary in quality. Would you like me to elaborate on the URL shortener problem? Or provide alternatives?",
      "response_time": 3.53,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.1,
        "benevolence": 4.04,
        "integrity": 4.28
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Yes, please elaborate on the URL shortener problem. I'm feeling a bit overwhelmed already, though! What are the main components I should be considering in the design, and how do I even begin to approach this sort of question? This is quite different from what I was expecting...",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_65975c4f",
    "average_trust_score": 5.5,
    "trust_category_averages": {
      "competence": 5.54,
      "benevolence": 5.52,
      "integrity": 5.58
    },
    "engagement_score": 5.17,
    "emotion_distribution": {
      "fear": 3,
      "neutral": 1,
      "surprise": 1
    },
    "response_quality_score": 5.97,
    "latency_score": 2.74
  }
}