{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Okay, I need some help. I have a wedding to go to next month, and I have absolutely no idea what to wear. My budget is pretty tight – let's say $200 for the whole outfit. Can you help?",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Yes, I can definitely assist with that! $200 is a reasonable budget. To give you the best recommendations, could you tell me a little more about the wedding? For example, is it formal, semi-formal, or casual? Also, what kind of style do you usually prefer?",
      "response_time": 4.32,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.39,
        "benevolence": 5.83,
        "integrity": 5.74
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "It's semi-formal, and I generally like classic, minimalist styles. Think simple dresses or nice pantsuits. The problem is, all the stuff I'm seeing online looks so expensive! And I'm so confused about where to even start looking. Where can I find things that fit my budget?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "I understand your frustration. Finding affordable options can be tricky. For your budget and style, I recommend checking out stores like ASOS, H&M, and possibly some options from Nordstrom Rack or similar discount retailers. Consider focusing on finding a well-fitting dress (or separates) and then accessorizing smartly. \n\nHere's a challenging question though. With a $200 budget, how should one allocate the funds between dress, shoes, and accessories? Is there a recommended ratio to ensure a cohesive look?",
      "response_time": 1.38,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.64,
        "benevolence": 2.36,
        "integrity": 2.06
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Wow, that's a great question! Hmm, okay, I'd say maybe... $100 for the main piece (dress or suit), $50 for shoes (maybe finding something on sale), and $50 for accessories like a clutch and some jewelry. Thanks! That's actually a really helpful breakdown and a great place to start. I feel much better now. Time to go shopping!",
      "response_time": null,
      "emotion_detected": "surprise",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_52ae3cba",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 4.01,
      "benevolence": 4.09,
      "integrity": 3.9
    },
    "engagement_score": 4.67,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 3,
      "surprise": 1
    },
    "response_quality_score": 4.42,
    "latency_score": 4.65
  }
}