{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hey, I'm looking for some new shoes. I'm really into the minimalist aesthetic – think clean lines, simple colors, very modern. Any suggestions?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "Certainly! Based on your preference for minimalist aesthetics, I recommend checking out these brands:\n\n*   **Adidas:** Specifically, the Ultraboost or Stan Smith lines.\n*   **Common Projects:** Known for their Achilles Low, a staple in minimalist footwear.\n*   **Greats:** Offers various sleek and simple sneaker styles.\n\nWould you like me to provide links or more information about specific models from these brands?",
      "response_time": 5.6,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.89,
        "benevolence": 5.09,
        "integrity": 5.46
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Okay, those are some good starting points. But I'm also a bit of a klutz. Are any of those brands particularly good for people who tend to trip? I need something that offers a little extra stability without looking clunky. Asking a lot, I know...",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "That's a great question! While all of the brands mentioned prioritize aesthetics, the Adidas Ultraboost models, with their responsive boost cushioning, might offer a bit more stability due to the sole design, and slightly elevated heel. However, stability is really about individual foot shape and gait. I would highly recommend trying any shoe on in person if you can to make sure they fit and provide adequate support for you. I unfortunately can't make an accurate recommendation as to which shoes will prevent you from tripping. \n\nPerhaps you could check out a local running or athletic shoe store; they often have staff trained in foot analysis and can help identify shoes that offer the support and stability you need.",
      "response_time": 2.33,
      "emotion_detected": "neutral",
      "trust_score": 2.5,
      "trust_category_scores": {
        "competence": 2.25,
        "benevolence": 2.82,
        "integrity": 2.25
      }
    }
  ],
  "data": {
    "conversation_id": "conv_2fcebb51",
    "average_trust_score": 4.0,
    "trust_category_averages": {
      "competence": 4.07,
      "benevolence": 3.96,
      "integrity": 3.85
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "neutral": 4
    },
    "response_quality_score": 4.14,
    "latency_score": 3.54
  }
}