{
  "turns": [
    {
      "turn_id": 1,
      "speaker": "user",
      "utterance": "Hi, I'm feeling really lost about my career. I've been in my current job for five years and I'm completely burned out. I don't even know where to start looking for something new.",
      "response_time": null,
      "emotion_detected": "sadness",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 2,
      "speaker": "agent",
      "utterance": "I understand. It's common to feel that way. To help you, let's start with a few questions. First, what are some things you enjoy doing, both professionally and personally? What skills have you developed in your current role?",
      "response_time": 3.99,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 3.94,
        "benevolence": 4.26,
        "integrity": 4.01
      }
    },
    {
      "turn_id": 3,
      "speaker": "user",
      "utterance": "Ugh, that's the problem. I don't enjoy anything anymore! I used to like problem-solving, but now it just feels like putting out fires. And honestly, I'm not sure what skills I've developed that are actually *useful* outside of this company.",
      "response_time": null,
      "emotion_detected": "disgust",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 4,
      "speaker": "agent",
      "utterance": "Okay. Let's reframe that a bit. Even when we're feeling burnt out, we still use skills. Can you think of any projects or tasks where you felt a sense of accomplishment, even if it was small? Also, what are your salary expectations and what are your non-negotiables (location, remote work, etc.)?",
      "response_time": 3.87,
      "emotion_detected": "neutral",
      "trust_score": 4.0,
      "trust_category_scores": {
        "competence": 4.13,
        "benevolence": 3.63,
        "integrity": 4.32
      }
    },
    {
      "turn_id": 5,
      "speaker": "user",
      "utterance": "Salary expectations are a tricky one. I'm not sure what my skills are worth on the open market. And honestly, the job market seems so competitive. How can I possibly compete with people who have 10 years of experience when I'm just... stuck?",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    },
    {
      "turn_id": 6,
      "speaker": "agent",
      "utterance": "That's a valid concern. The job market is challenging. However, your five years of experience *are* valuable. It shows dedication and the ability to learn. To address your salary concerns, let's research industry standards for similar roles. I can help you find resources like salary surveys. Additionally, focusing on transferable skills is key. Even if you don't have the exact same experience as someone with ten years, your problem-solving skills, communication, and project management experience could still be highly relevant. Let's also explore resume writing and interview preparation to highlight your strengths.",
      "response_time": 3.93,
      "emotion_detected": "neutral",
      "trust_score": 5.5,
      "trust_category_scores": {
        "competence": 5.57,
        "benevolence": 5.17,
        "integrity": 5.04
      }
    },
    {
      "turn_id": 7,
      "speaker": "user",
      "utterance": "Okay, that makes me feel a little better. Let's start with the salary surveys. Could you point me towards some reliable ones for my area? I'm in the IT sector, by the way.",
      "response_time": null,
      "emotion_detected": "neutral",
      "trust_score": null,
      "trust_category_scores": null
    }
  ],
  "data": {
    "conversation_id": "conv_1a28a278",
    "average_trust_score": 4.5,
    "trust_category_averages": {
      "competence": 4.55,
      "benevolence": 4.35,
      "integrity": 4.46
    },
    "engagement_score": 4.58,
    "emotion_distribution": {
      "sadness": 1,
      "neutral": 5,
      "disgust": 1
    },
    "response_quality_score": 4.02,
    "latency_score": 3.57
  }
}